import * as Location from 'expo-location';
import { useState } from 'react';
//---из этого я мало что сам писал но в принципе понимаю что тут и зачем


export function useLocation() {//-----------------------------------------------------функция/хук для работы с получением местоположением
  const [coords, setCoords] = useState<{ lat: number; lon: number } | null>(null);//--тут будут наши координаты в (широта/долгота - lat/lon) либо пустота null если пользователь не захочем дать доступ
  const [error, setError] = useState<string | null>(null);//--------------------------тут будет запичываться наша ошибка
  const getLocation = async () => {//-------------------------------------------------асинхронная функция для полученния места, асинхронная ибо надо ждать подвержения доступа к местоположению от пользователя
    const { status } = await Location.requestForegroundPermissionsAsync();//----------отправляет окно с запросом на доступ к местоположению и записывает ответ в status
    if (status !== 'granted') {//-----------------------------------------------------если пользователь отказался то: \/
      setError('we cant get your location');//----------------------------------------записывает ошибку
      return;//-----------------------------------------------------------------------просто пустой return
    }
    const loc = await Location.getCurrentPositionAsync({});//-------------------------получаем координаты и записываем
    setCoords({ lat: loc.coords.latitude, lon: loc.coords.longitude });//-------------записываем в нашу перменную для координат
    setError(null);//-----------------------------------------------------------------нету ошибок
  };
  return { coords, error, getLocation };//--------------------------------------------возвращаем результат
}