//бтблтотека для глобального хранилища, чтобы другие файлы могли использовать и записывать все в спикок мест
import { create } from 'zustand';
//наследуем тип данных Place -> (id: number;name: string;type: PlaceType;raiting: number;adress: string;image: string;) для использования и не переписывания его по новой
import { Place } from '@/Data/InterPlaces';
import placesInter from '../Data/InterPlaces';

interface PlacesList {//-------------------глобальная типо переменная имеющая внутри \/
  places: Place[];//-----------------------список всех мест с нашим типом данный имеющим айди, название и т.д.
  favorites: number[];//-------------------список айдишников тех мест которые мы добавим в избранное, мы будем ее использовать для фильтров по избранным местам
  addPlace: (place: Place) => void;//------функция для добавления нового места которую можно будет использовать в других файлах
  addFavorite: (id: number) => void;//-----добавить айди места в избранное в масив favorites
  removeFavorite: (id: number) => void;//--удалить айди избраного места
}


export const usePlacesList = create<PlacesList>((set) => ({//----------типо реализация наших функицй для PlacesList, реализация интерфеса
  places: [...placesInter],//------------------------------------------передаем нашу мок даут из InterPlaces
  favorites: [],

  addPlace: (place) =>//-----------------------------------------------реализация функции добавления элемента в масив мест, мы передаем как параметр элемент нашего спевдотипа данных он же интерфейс Place в папке places
    set((s) => ({ places: [...s.places, place] })),//------------------мы берем наш масив мест который обображается как ... и добавляем к нему элемент интрефеса Place в конец, я знаю что тут есть .push() но он почему-то не работал, вероятно я просто не правильно это написал. поэтому спросил ии как это можно реализовать иначе

  addFavorite: (id) =>//-----------------------------------------------реализация функции добавить в избраное по айди
    set((s) => ({ favorites: [...s.favorites, id] })),//---------------добавляем айди к нашему масиву ... в конец

  removeFavorite: (id) =>//--------------------------------------------реализация функции убрать из избраного
    set((s) => ({ favorites: s.favorites.filter(f => f !== id) })),//--тут мы удаляем елемент с помощью фильтрации нашего масива фильтр-(наш масив без этого айди). что-то по типу .delete() или remoove() я не нашел 
}));